import moment from 'moment'
window.dataPool = {

}

window.dataPool.leftTop = (function () {
    const dayData = ["848728", "846694", "847284", "869653", "879019", "848156", "843722"];
    const callData = ["18186272", "18768609", "19788863", "20199422", "18615759", "18496444", "18166144"];
    let dateData = []
    let now = new Date('2019/07/30')
    var date = now.getDate();
    for (let i = 6; i >= 0; i--) {
        now.setDate(date - i)
        dateData.push(moment(now).format('M月DD日'))
    }
    return {
        dateData,
        dayData: dayData.reverse(),
        callData: callData.reverse()
    }
})()
window.dataPool.leftCenter = (function () {
    const yData = ["成语接龙", "诗词接龙", "猜儿歌", " 猜数字", "猜动物"];
    const xData = ["1071953", "253781", "180770", "176541", "97323"];
    return {
        yData, xData
    }
})()

window.dataPool.RMFData = (function () {
    const yData = ["重要价值用户", "其他", "重要发展用户", "重要保持用户"];
    const xData = ["32.71", "29.01", "21.92", "16.36"];
    return yData.map((name, index) => {
        return {
            name: name,
            value: xData[index]
        }
    })
})()
window.dataPool.leftBottom = (function () {
    const lineData = ["22615", "61885", "88460", "72190", "57280", "52100", "48530", "42920", "39040", "41490", "52310", "57620", "55010", "50680", "50045", "48405", "37585", "13625", "2170", "500", "485", "545", "1285", "5775"].reverse()
    const barData = ["23070", "62195", "87045", "71945", "55715", "52240", "48395", "43015", "39045", "40560", "51210", "56155", "54275", "50375", "49080", "47240", "37805", "13370", "2075", "425", "370", "460", "1320", "5395"].reverse()
    const timeData = [...Array(24).keys()]
    return {
        timeData,
        lineData,
        barData
    }
})()
window.dataPool.centerBottom = (function () {
    return ["小猪佩奇", "拼音", "讲故事", "睡前故事", "我想听故事", "故事", "我要听故事", "童话故事", "讲个故事", "狗怎么叫", "超级飞侠", "猜歌", "越剧", "白雪公主", "格林童话", "听故事", "西游记", "小毛驴", "蜜桃姐姐讲故事", "宝宝巴士", "十万个为什么", "学狗叫", "讲一个故事", "小红帽", "猫怎么叫", "三只小猪", "老虎怎么叫", "给我讲个故事", "成语故事", "萌鸡小队", "讲个故事吧", "汪汪队", "骆驼", "灰姑娘", "我想听成语故事", "米小圈上学记", "英语", "放故事", "狮子怎么叫", "猪怎么叫", "乘法口诀", "儿童故事", "天猫叫", "三国演义", "我想听睡前故事", "彩虹宝宝", "白雪公主的故事", "动画片", "嗯", "成语接龙", "你叫什么名字", "我叫什么名字", "来个笑话", "宾果", "呵呵", "1加1等于几", "我的名字叫什么", "为什么", "现在几点了", "小苹果", "沙漠骆驼", "宝贝宝贝", "学猫叫", "小鸡小鸡", "小兔子乖乖", "小跳蛙", "世上只有妈妈好", "两只老虎", "海草舞", "唱儿歌", "数鸭子", "摇篮曲", "甩葱歌", "我要听儿歌", "卡路里", "歌曲", "白龙马", "猜儿歌", "放儿歌", "生僻字", "大王叫我来巡山", "小燕子", "播放儿歌", "葫芦娃", "唱首歌吧", "爸爸", "狂浪", "放一首", "小星星", "奥特曼", "江南style", "捉泥鳅", "拔萝卜", "英文儿歌", "虫儿飞", "流行歌曲", "来首儿歌", "来自天堂的魔鬼", "小白兔", "小宝贝", "给我唱一首", "来一首", "早发白帝城", "三字经", "弟子规", "我想听三字经", "唐诗300首", "唐诗", "静夜思", "春晓", "咏鹅", "悯农", "来首唐诗", "千字文", "望庐山瀑布", "登鹳雀楼", "梅花", "我要听三字经", "相思", "唱一首诗", "琵琶行", "咏柳", "我要听一首词", "江南", "我想听唐诗", "我想听一首词", "鹅鹅鹅", "游子吟", "百家姓", "放一首诗", "我想听个诗", "出塞", "播放三字经", "忆江南", "风", "赠汪伦", "我要听唐诗", "我要听个诗", "我想听首词", "来一首唐诗", "我想听弟子规", "来首李白的唐诗", "我要听个词", "海草", "小池", "清明", "江雪", "我想听首诗", "背古诗", "绝句", "听个诗", "垃圾分类是啥", "你笑起来真好看", "爱我你就抱抱我", "神奇校车", "围棋是谁发明的", "脑筋急转弯", "什么是月海", "垃圾分类", "为什么垃圾要分类", "厨房垃圾都有什么", "香蕉皮是干垃圾吗", "手机属于什么垃圾", "什么是干垃圾", "塑料瓶属于什么垃圾", "垃圾分类有哪些", "卫生纸是什么垃圾","垃圾分类是啥","你笑起来真好看","爱我你就抱抱我","神奇校车","围棋是谁发明的","脑筋急转弯","什么是月海","垃圾分类","为什么垃圾要分类","厨房垃圾都有什么","香蕉皮是干垃圾吗","手机属于什么垃圾","什么是干垃圾","塑料瓶属于什么垃圾","垃圾分类有哪些","卫生纸是什么垃圾","米小圈","抖音","古诗","不一样的卡梅拉","轻音乐","儿歌","海底小纵队","绿色","阿U","恐龙","螺丝钉","黑猫警长","抖音歌曲","马丁","心如止水","我是小海军","装在口袋里的爸爸","等俺有钱了","跳跳米","五只小鸭","Supermarket","第79集 小苹果","中国","美女与野兽2","冒险家","自食其果的邻居","Dessert Time","吹口哨","美女与野兽1","青蛙最伟大","勇敢的小刺猬","我们的公鸡不见了","新年好","逆战","蔬菜花园","房屋建筑","全部都是你","带你去旅行","红昭愿","踩面包的姑娘1","聪明的爱尔莎","Jimmy Crack Corn","儿歌大全","少林英雄","我最好的朋友","我爱原汁","恭喜恭喜","松鼠睡觉","一曲相思","出租时间的熊爷爷","Twinkle Twinkle Little Star","经典儿歌","迪迦奥特曼","我想玩猜歌","爆笑校园","疯狂校园","天蓬大元帅","为什么骆驼","爆笑虫子","笑猫日记","太阳咪咪笑","为什么嘞","我想玩猜歌名","爸爸的英语叫什么","小朋友哭了","宝宝不哭","苹果英语叫什么","讲个笑话","你好","再见","我先来","我要听","唱首儿歌","不知道","我想听儿歌","唱歌","你先来","唱一首","您好","谢谢","聪聪","苹果","摇一摇","宝贝","你是谁","我们一起学猫叫","我要听歌","熊出没","来首音乐","听歌","播放歌曲","跳舞","我想听歌","唱小苹果","唱一首儿歌","大梦想家","放一首儿歌","小白兔白又白","我想听沙漠骆驼","咖喱咖喱","唱一首歌","社会摇","我是谁","机器人","你几岁啦","青春修炼手册","采蘑菇的小姑娘","平凡之路","几点了","我的好妈妈","彩虹的约定","跳个舞","贝瓦儿歌","我想听小苹果","词语接龙","飞花令","蓝精灵","嘎嘎","我叫什么","小老鼠上灯台","今天天气怎么样","播放小苹果","催眠曲","我爱你","好妈妈","小蝌蚪找妈妈","厚厚熊","儿童歌曲","放歌","唱一首小苹果","晚安","字母歌","我要听小苹果","你叫什么名字啊","雪宝宝","你的名字叫什么","换一个","放一首歌","健康歌","锄禾日当午","睡觉","最美的光","石头剪刀布","妈妈的名字叫什么","小螺号","你叫什么名字呀","再讲一个笑话","小青蛙","播放音乐","唱一首沙漠骆驼","猜歌名","我要听沙漠骆驼","爸爸的名字叫什么","现在几点","来一首音乐","早上好","光头强","卖报歌","刚好遇见你","再来一个","远走高飞","放一首小苹果","夜之光","洗刷刷","鱼怎么叫","讲一个笑话","红山果","猜歌曲","丢手绢","我的名字是什么","我想听学猫叫","黎明前的黑暗","生日快乐","现在几点啦","宇宙护卫队","鲁冰花","一闪一闪亮晶晶","春天在哪里","一只哈巴狗","好爸爸坏爸爸","感觉自己萌萌哒","一心一意","猴哥","小朋友","我想听笑话","我知道","好汉歌","美美哒","大头儿子小头爸爸","我爱北京天安门","我想听狂浪","喜羊羊","几点啦","我想看","泥娃娃","巴啦啦小魔仙","我想听来自天堂的魔鬼","牛奶歌","给个提示","小老鼠","光年之外","c哩c哩","小水果","小猪佩奇的故事","给我讲个笑话","蜗牛与黄鹂鸟","放学歌","放一首狂浪","我要听成语故事","跳个舞吧","再来一个笑话","what's your name","我想听生僻字","凉凉","播放沙漠骆驼","三只小熊","放一首沙漠骆驼","最炫民族风","播放小猪佩奇","猜谜语","请关机","我想听小猪佩奇","好宝宝","我想听歌曲","人之初","爸爸去哪儿","1加1等于多少","打电话","谁知盘中餐","人山人海","燃烧我的卡路里","你在干嘛","我想听童话故事","我要玩成语接龙","小狗怎么叫","你是谁呀","哈巴狗","2加2等于几","外婆的澎湖湾","拍手歌","相声","花桥流水","粉刷匠","我的名字","卖汤圆","爸爸妈妈","上学歌","讲一个","隐形的翅膀","大卫不可以","找朋友","小猪","给我讲一个","答案是什么","我想听音乐","你好呀","牛怎么叫","嘴巴嘟嘟","嗯嗯","听音乐","小鸭子","小兔子","玩成语接龙","我要听笑话","我们不一样","放歌曲","可是","胎教音乐","快乐","乘法口诀表","灰姑娘的故事","今天星期几","笑起来真好看","兔子怎么叫","大象怎么叫","唱个儿歌","兔子乖乖","给我放一首","请开灯","晚上好","好听的儿歌","真的吗","唱个小苹果","寓言故事","给我唱首歌","播放一首","1001夜","蛇怎么叫","乖乖","羊怎么叫","兰花草","1加1","加油","茉莉花","哆啦a梦","天天向上","妈妈好","大头儿子","狼怎么叫","你几岁了","恐龙怎么叫","小猫钓鱼","给我唱一首歌","一起学猫叫","明天天气怎么样","来一首儿歌","123我爱你","你知道我叫什么名字吗","孙悟空","恐龙的故事","天之大","猴子怎么叫","唱个歌","小龙人","弟弟的名字叫什么","天气预报","宝宝巴士儿歌","唱一首狂浪","爸爸妈妈听我说","小玉米","冰雪奇缘","妹妹的名字叫什么","国歌","你说啥","我想听你笑起来真好看","神话故事","我想听宝贝宝贝","缘分一道桥","来个猜歌","我们来玩成语接龙吧","给我讲一个故事","生日快乐歌","how are you","我要听历史","我想玩成语接龙","我要听音乐","狐假虎威","海阔天空","锄禾日当午的下一句是什么","你在干什么","床前明月光","我叫什么名字啊","我要听小猪佩奇","什么呀","海草海草","唱沙漠骆驼","种太阳","快乐小猪","再讲个笑话","你给我","我要听歌曲","100加100等于几","喜羊羊与灰太狼","我要听睡前故事","好爸爸","我问你","妈呀","听歌曲","啦啦啦","大笑江湖","只有妈妈好","让我们荡起双桨","哥哥的名字叫什么","猫和老鼠","给我讲故事","我要听童话故事","苹果的英语怎么说","唱世上只有妈妈好","你会唱歌吗","讲成语故事","祝你生日快乐","你吃饭了吗","我要听学猫叫","我要听生僻字","告白气球","成都","放一个","我不想听儿歌","姐姐的名字叫什么","赞","小冰姐姐讲故事","钢琴曲","放首儿歌","来一首小苹果","爱上幼儿园","夜空中最亮的星","休息一下","thankyou","浪花一朵朵","apple","小猩猩","我想听逆战","数字歌","唱两只老虎","你真棒","龟兔赛跑","唱一首学猫叫","声音小一点","李白是谁","妈妈叫什么名字","霸王龙","小红帽的故事","王老先生有块地","卡洛琳","海绵宝宝","我想听心如止水","我要听逆战","我和我的祖国","大耳朵图图","金色童年","猪之歌","给我讲个故事吧","明天会更好","我想听好嗨哟","下午好","巴拉巴拉小魔仙","奶奶的名字叫什么","奥特曼之歌","你的爸爸妈妈是谁","植物大战僵尸","恐龙故事","我喜欢你","good","我不上你的当","我要听狂浪","读书郎","唱一首世上只有妈妈好","安徒生童话","妈妈的吻","李白","汗滴禾下土","我爱洗澡","小猫怎么叫","苹果用英语怎么说","迷你特工队","声音大一点","唱小兔子乖乖","小朋友好","请唱一首","刷牙歌","老鼠怎么叫","3加3等于几","公鸡怎么叫","鲁智深是谁","我想听一首儿歌","什么名字","中国范","播放学猫叫","用英语怎么说","8加8等于几","童话","数星星","爸爸叫什么名字","我想听白雪公主的故事","good morning","起床啦","葫芦娃的故事","来个故事","追光者","爷爷的名字叫什么","我妈妈的名字叫什么","我也不知道","妈妈的名字是什么","今天的天气怎么样","猜动物","三只小猪的故事","4加4等于几","我想听蜜桃姐姐讲故事","清明上河图","祖国的花朵","唱一首宝贝宝贝","铃儿响叮当","守株待兔","大小姐","青蛙王子","小白兔乖乖","大家","爸爸的名字是什么","你再说一遍","播放生僻字","为所欲为","奥特曼的故事","英文字母歌","我要听宝贝宝贝","唱一首来自天堂的魔鬼","马怎么叫","青花瓷","你今年几岁啦","卖火柴的小女孩","奥特曼主题曲","学习雷锋好榜样","现在几点钟","我喜欢","再来个笑话","干啥","放个儿歌","掩耳盗铃","玩个猜歌","听小苹果","荷塘月色","亡羊补牢","我想听虫儿飞","怎么啦","播放宝贝宝贝","听个故事","我想听流行歌曲","讲童话故事","春眠不觉晓","妈妈的名字","记住","麦迪","东方红","恐龙世界","爱情","棒棒糖","举头望明月","爸爸妈妈去上班","5加5等于几","好哇","播放小跳蛙","我想听卡路里","隔壁的泰山","我想听大梦想家","奥特曼的歌","goodbye","听妈妈的话","鸭子怎么叫","你先来吧","奥特曼歌","播放小鸡小鸡","唱首儿歌吧","江南时代","唱首小苹果","你的酒馆对我打了羊","天堂的魔鬼","我会听话","阳光彩虹小白马","我上幼儿园","1加2等于几","唱小燕子","爸爸的名字","吉祥三宝","小可爱","小马宝莉","给我唱一首沙漠骆驼","睡美人","你休息吧","讲一个睡前故事","感恩的心","汪汪队立大功","洗澡歌","十全十美","我们来玩成语接龙","我想听我们一起学猫叫","我爸爸的名字叫什么","红楼梦","小花猫","讨厌","放一首宝贝宝贝","画蛇添足","沙漠骆驼的歌","海的女儿","中国历史","讲睡前故事","微微一笑很倾城","鸡怎么叫","我想听白雪公主","黑猫警长的故事","大花轿","蜘蛛侠","我想听个故事","我想听格林童话","我想听小鸡小鸡","粒粒皆辛苦","绕口令","唱宝贝宝贝","海草歌","听一首儿歌","三个和尚","公主的故事","我要听好嗨哟","我想听白龙马","喂喂喂","朋友","唱国歌","妈妈叫什么","我的世界","快乐儿歌","青蛙怎么叫","小猫咪","小苹果儿","唱首歌","我要听流行歌曲","夜来风雨声","工程车","我想听大王叫我来巡山","小马过河","你会跳舞吗","来一首沙漠骆驼","起风了","猜猜我有多爱你","水浒传","你在吗","花仙子","我想听凉凉","向前走","我有一个好妈妈","爸爸叫什么","i love you","你好吗","爸爸的爸爸叫什么","你喜欢我吗","加油歌","播放流行音乐","水果歌","大王来巡山","我要玩猜歌","我不喜欢你","播放好嗨哟","可不可以","唱一首小兔子乖乖","唱小星星","你知道我的名字吗","我想听灰姑娘的故事","今天的天气","我想听摇篮曲","how old are you","我想听两只老虎","也许小鸡","笨笨熊的故事","大灰狼的故事","阿凡提的故事","凤凰传奇","幸福拍手歌","狼和七只小羊","come on","放一首来自天堂的魔鬼","美人鱼","泰罗奥特曼","往后余生","明天的天气","我想听西游记","白日依山尽","泼水歌","我要听白雪公主的故事","放一首小跳蛙","我想听葫芦娃","你去休息吧","10加10等于几","小苹果的歌","我想听奥特曼","苹果的英文怎么说","播放小星星","唱一首摇篮曲","今天会下雨吗","你好用英语怎么说","我几岁了","我弟弟叫什么名字","蜡笔小新","我要睡觉了","大头儿子和小头爸爸","唱一首虫儿飞","苏菲亚","我想听38度六","唱个小燕子","放一首生僻字","我想听灰姑娘","我想听最美的光","离人愁","我要听光年之外","歌曲生僻字","我要听宝宝巴士","忆江南","拥抱你离去","播放甩葱歌","来个笑话吧","唱一首数鸭子","请播放小苹果","唱一首童年","童话镇","读首唐诗","睡前小故事","放一首海草舞","唱一首歌曲","恭喜发财","播放平凡之路","小猪佩奇小猪佩奇","张杰的歌","6加6等于几","香蕉用英语怎么说","放一首世上只有妈妈好","我想听超级飞侠","三生三世十里桃花","巴巴爸爸","英语故事","我要听凉凉","我猜儿歌","奶奶的名字是什么","唱小毛驴","魔法城堡","望天门山","1加1等于几呀","唱一首两只老虎","我要听丑八怪","我生气了","我要听江南style","唱一首我们一起学猫叫","唱一首逆战","唐诗联唱","狂狼","你有妈妈吗","我想听追光者","我想听小红帽","好听的歌曲","植物大战僵尸的故事","唱一首捉泥鳅","唱一首儿歌吧","唱一首心如止水","我要听白雪公主","雪绒花","播放白龙马","拔苗助长","粉红色的回忆","我想听我们不一样","妈妈的妈妈叫什么","播放世上只有妈妈好","因为刚好遇见你","请播放小猪佩奇","我要听社会摇","我的好爸爸","米小圈上学","我要听甩葱歌","常回家看看","播放大梦想家","歌曲童年","搞笑故事","弟弟叫什么名字","唱一首小毛驴","爷爷的名字是什么","葫芦娃的歌","狗是怎么叫的","播放光年之外","来首音乐吧","余情未了","睡前儿歌","你妈妈叫什么名字","唱拔萝卜","猴哥猴哥","播放熊出没","唱一首小白兔","1加3等于几","我要听青春修炼手册","我想听远走高飞","敕勒歌","张杰的逆战","滥竽充数","八仙过海","圣诞歌","冬天里的一把火","九九八十一","司马光砸缸","美人鱼的故事","唱一首葫芦娃","我想听薛之谦的歌","唱一首卡路里","中国功夫","高山流水","播放凉凉","阿里巴巴","来一个脑筋急转弯","我要玩词语接龙","讲一个白雪公主的故事","小猪佩奇第二集","100加100等于多少","我要听小猪佩奇的故事","我要听小星星","你知道我叫什么吗","我想听黑猫警长","我哥哥的名字叫什么","我要听米小圈上学记","姐姐的名字是什么","亲亲我的宝贝","潇洒走一回","我想听三国演义","我的好兄弟","我们来聊天吧","再说一个笑话","讲儿童故事","我想听弟子规","巴拉巴拉樱之花","将进酒","长歌行","我有一个家","你会说英语吗","菠萝菠萝蜜","薛之谦的歌","播放好听的儿歌","小伴龙儿歌","我想听寓言故事","我是女生","小儿垂钓","播放格林童话","猪是怎么叫的","中华孝道","放首小苹果","唱一曲相思","播放虫儿飞","来一首学猫叫","唱一首大王叫我来巡山","我要听唐诗","家庭称呼歌","兄弟抱一下","狗的叫声","我想听好汉歌","放小燕子","我想听米小圈","背三字经","你的爸爸妈妈是谁呀","明天什么天气","我要听灰姑娘的故事","我想听熊出没","爸爸的英语怎么说","皇帝的新装","爸爸的妈妈叫什么","小七我叫什么名字","米小圈的故事","放一首小燕子","自由飞翔","花木兰","唱个小苹果儿","今天下雨吗","我要听燃烧我的卡路里","帮帮龙出动","1乘1等于几","花心","小公主苏菲亚","小情歌","寻隐者不遇","唱个小兔子乖乖","16加16等于几","放一首两只老虎","九九乘法表","唱一首江南style","我想听捉泥鳅","离离原上草","我要听刚好遇见你","映山红","播放C哩C哩","读三字经","播放米小圈上学记","学狼叫","我想听小红帽的故事","请播放来自天堂的魔鬼","放一首江南style","乌龟怎么叫","我问你个问题","听童话故事","我想听咖喱咖喱","哇咔哇咔","我想听父亲","猫和老鼠的故事","你会干什么","播放大王叫我来巡山","开门见山","儿歌小毛驴","拔萝卜儿歌","妈妈的英语怎么说","世上只有妈妈好","9月9日忆山东兄弟","站在草原望北京","伊索寓言","说散就散","我妈妈叫什么","你爸爸叫什么名字","放小星星","同桌的你","26个英文字母","播放海草舞","桃花潭水深千尺","我想听成都","沁园春雪","我是一条小青龙","孔融让梨","哥哥的名字是什么","实事求是","我爸爸叫什么","我想听告白气球","小幸运","你是男孩还是女孩","晚安故事","我想听童年","播放葫芦娃"]
})()
window.dataPool.rightCenter = (function () {
    return {
        xData: ["0-5", "6-10", "11-30", "31-60", "61-90", "91-120", "121-180", "180+"],
        yData: ["44247", "79929", "189111", "281995", "120922", "68022", "77655", "57879"]
    }
})()

window.dataPool.rightCenter2 = (function () {
    return {
        yData: ["沙漠骆驼", "白雪公主", "宝贝宝贝", "夏洛的网", "我妈妈"],
        xData: ["134638", "97102", "83143", "62908", "56626"]
    }
})()



window.dataPool.yyjhData = (function () {
    return [{
        name: '中性',
        value: 46.36
    }, {
        name: '快乐',
        value: 25.24
    }, {
        name: '喜欢',
        value: 17.15
    }, {
        name: '思念',
        value: 7.07
    }, {
        name: '愤怒',
        value: 4.18
    }]
})()