import moment from 'moment'
window.dataPool = {

}

window.dataPool.leftTop = (function () {
    const dayData = ["905310", "903140", "903770", "927630", "937620", "904700", "899970"];
    const callData = ["9699345", "10009925", "10554060", "10773025", "9928405", "9864770", "9688610"];
    let dateData = []
    let now = new Date()
    var date = now.getDate();
    for (let i = 6; i >= 0; i--) {
        now.setDate(date - i)
        dateData.push(moment(now).format('M月DD日'))
    }
    return {
        dateData,
        dayData: dayData.reverse(),
        callData: callData.reverse()
    }

})()
window.dataPool.leftCenter = (function () {
    const yData = ["成语接龙", "诗词接龙", "猜儿歌", " 猜数字", "猜动物"];
    const xData = ["1071953", "84593", "60256", "58847", "22441"];
    return {
        yData, xData
    }
})()

window.dataPool.RMFData = (function () {
    const yData = ["重要价值用户", "其他", "重要发展用户", "重要保持用户"];
    const xData = ["32.71", "29.01", "21.92", "16.36"];
    return yData.map((name, index) => {
        return {
            name: name + ' ' + xData[index] + '%',
            value: xData[index]
        }
    })
})()
window.dataPool.leftBottom = (function () {
    const lineData = ["4614", "12439", "17409", "14389", "11143", "10448", "9679", "8603", "7809", "8112", "10242", "11231", "10855", "10075", "9816", "9448", "7561", "2674", "415", "85", "74", "92", "264", "1079"].reverse()
    const barData = ["4614", "12439", "17409", "14389", "11143", "10448", "9679", "8603", "7809", "8112", "10242", "11231", "10855", "10075", "9816", "9448", "7561", "2674", "415", "85", "74", "92", "264", "1079"].reverse()
    const timeData = [...Array(24).keys()]
    return {
        timeData,
        lineData,
        barData
    }
})()
window.dataPool.centerBottom = (function () {
    return ["小猪佩奇", "拼音", "讲故事", "睡前故事", "我想听故事", "故事", "我要听故事", "童话故事", "讲个故事", "狗怎么叫", "超级飞侠", "猜歌", "越剧", "白雪公主", "格林童话", "听故事", "放个屁", "西游记", "小毛驴", "蜜桃姐姐讲故事", "宝宝巴士", "十万个为什么", "学狗叫", "讲一个故事", "小红帽", "猫怎么叫", "三只小猪", "老虎怎么叫", "给我讲个故事", "成语故事", "萌鸡小队", "讲个故事吧", "汪汪队", "骆驼", "灰姑娘", "我想听成语故事", "米小圈上学记", "英语", "放故事", "狮子怎么叫", "猪怎么叫", "乘法口诀", "儿童故事", "天猫叫", "三国演义", "我想听睡前故事", "彩虹宝宝", "白雪公主的故事", "动画片", "嗯", "成语接龙", "你叫什么名字", "我叫什么名字", "来个笑话", "宾果", "呵呵", "1加1等于几", "我的名字叫什么", "为什么", "现在几点了", "未来小七", "小苹果", "沙漠骆驼", "宝贝宝贝", "学猫叫", "小鸡小鸡", "小兔子乖乖", "小跳蛙", "世上只有妈妈好", "两只老虎", "海草舞", "唱儿歌", "数鸭子", "摇篮曲", "甩葱歌", "我要听儿歌", "卡路里", "歌曲", "白龙马", "猜儿歌", "放儿歌", "生僻字", "大王叫我来巡山", "小燕子", "播放儿歌", "葫芦娃", "唱首歌吧", "爸爸", "狂浪", "放一首", "小星星", "奥特曼", "江南style", "捉泥鳅", "拔萝卜", "英文儿歌", "虫儿飞", "流行歌曲", "来首儿歌", "来自天堂的魔鬼", "小白兔", "小宝贝", "给我唱一首", "来一首", "早发白帝城", "三字经", "弟子规", "我想听三字经", "唐诗300首", "唐诗", "静夜思", "春晓", "咏鹅", "悯农", "来首唐诗", "千字文", "望庐山瀑布", "登鹳雀楼", "梅花", "我要听三字经", "相思", "唱一首诗", "琵琶行", "咏柳", "我要听一首词", "江南", "我想听唐诗", "我想听一首词", "鹅鹅鹅", "游子吟", "百家姓", "放一首诗", "我想听个诗", "出塞", "播放三字经", "忆江南", "风", "赠汪伦", "我要听唐诗", "我要听个诗", "我想听首词", "来一首唐诗", "我想听弟子规", "来首李白的唐诗", "我要听个词", "海草", "小池", "清明", "江雪", "我想听首诗", "背古诗", "绝句", "听个诗", "垃圾分类是啥", "你笑起来真好看", "爱我你就抱抱我", "神奇校车", "围棋是谁发明的", "脑筋急转弯", "什么是月海", "垃圾分类", "为什么垃圾要分类", "厨房垃圾都有什么", "香蕉皮是干垃圾吗", "手机属于什么垃圾", "什么是干垃圾", "塑料瓶属于什么垃圾", "垃圾分类有哪些", "卫生纸是什么垃圾"]
})()
window.dataPool.rightCenter = (function () {
    return {
        xData: ["0-5", "6-10", "11-30", "31-60", "61-90", "91-120", "121-180", "180+"],
        yData: ["44247", "79929", "189111", "281995", "120922", "68022", "77655", "57879"]
    }
})()

window.dataPool.rightCenter2 = (function () {
    return {
        yData: ["小苹果", "宝贝宝贝", "沙漠骆驼", "学猫叫", "小鸡小鸡"],
        xData: ["134638", "97102", "83143", "62908", "56626"]
    }
})()



window.dataPool.yyjhData = (function () {
    return [{
        name: '一般',
        value: 46.36
    }, {
        name: '快乐',
        value: 25.24
    }, {
        name: '喜欢',
        value: 17.15
    }, {
        name: '思念',
        value: 7.07
    }, {
        name: '愤怒',
        value: 4.18
    }]
})()